<a href="https://colab.research.google.com/github/hyunaeee/KU-SW-Academy/blob/main/0905.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

In [ ]:
con = sqlite3.connect(':memory:')

In [ ]:
cur=con.cursor()

In [ ]:
cur.execute('sql문 1개') -사용법 설명
cur.executemany('sql문 1개가 반복실행')
cur.executescript('sql문 여러개가 한번에 실행')

SyntaxError: ignored

In [ ]:
cur.execute('''
     CREATE TABLE CITY(
        CNO INTEGER PRIMARY KEY,
        CNAME TEXT
     )
''')

In [ ]:
cur.execute('''
    INSERT INTO CITY (CNO, CNAME)
    VALUES(1, "London");
''')

In [ ]:
cur.execute('''
    INSERT INTO CITY
    VALUES(2, "Paris")
''')

In [ ]:
cur.execute('''
    INSERT INTO CITY (CNAME)
    VALUES("Rome")
''')

In [ ]:
cur.execute('''
    INSERT INTO CITY
    VALUES(NULL, "Vienna")
''')

In [ ]:
cur.fetchone('Tuple/Record/Row 1개')- 설명
cur.fetchmany('N개')
cur.fetchall('All')

TypeError: ignored

In [ ]:
cur.execute('SELECT * FROM CITY')

In [ ]:
# cur.fetchone()
# cur.fetchmany(2)
cur.fetchall()

[(1, 'London'), (2, 'Paris'), (3, 'Rome'), (4, 'Vienna')]

In [ ]:
cur.execute('''
    CREATE TABLE TEMP(
        PK INTEGER NOT NULL UNIQUE,
        NAME CHAR(5) NOT NULL
    )
''')

In [ ]:
cur.execute('INSERt INTO TEMP VALUES(1, "ABCDEFGGHH")')

In [ ]:
cur.execute('SELECT * FROM TEMP')

In [ ]:
cur.fetchall()

[(1, 'ABCDEFGGHH')]

In [ ]:
cur.execute('''
    CREATE TABLE SUPPLIER(
        SNO INTEGER PRIMARY KEY,
        SNAME TEXT NOT NULL DEFAULT 'NONAME',
        CNO INTEGER NOT NULL
    )
''')

In [ ]:
# qmark = ?, named = k:v
sname = 'Smith'
cno = 1

cur.execute('''
    INSERT INTO SUPPLIER VALUES(NULL, ?, ?);
''', (sname, cno))

In [ ]:
cur.execute('SELECT * FROM SUPPLIER')
cur.fetchall()

[(1, 'Smith', 1)]

In [ ]:
data = (('Jones', 2), ('Adams', 1), ('Blake', 3))

cur.executemany('''
    INSERT INTO SUPPLIER VALUES(NULL, ?, ?);
''', data)

In [ ]:
len(data), len(data[0])

(3, 2)

In [ ]:
cur.execute('SELECT * FROM SUPPLIER')
cur.fetchall()

[(1, 'Smith', 1), (2, 'Jones', 2), (3, 'Adams', 1), (4, 'Blake', 3)]

In [ ]:
cur.execute('''
    CREATE TABLE PART(
        PNO INTEGER PRIMARY KEY AUTOINCREMENT,
        PNAME TEXT
    )
''')

In [ ]:
cur.execute('''
    INSERT INTO PART
    VALUES(:pno, :pname)
''', {'pno':1, 'pname':'Screw', 'asdf':'asdf'})

In [ ]:
cur.execute('SELECT * FROM PART')
cur.fetchall()

[(1, 'Screw')]

In [ ]:
data = [{'pname':'Nut'},
        {'pname':'Bolt'},
        {'pname':'Cam'}]

cur.executemany('''
    INSERT INTO PART
    VALUES(NULL, :pname)
''', data)

In [ ]:
cur.execute('''
    CREATE TABLE SELLS(
        SNO INTEGER NOT NULL,
        PNO INTEGER NOT NULL,
        PRICE INTEGER NOT NULL
    );
''')

In [ ]:
key1 = 'Screw'
key2 = 'Smith'
sno = 0
pno = 0

cur.execute('''
    SELECT PNO FROM PART
    WHERE PNAME=?
''', [key1])
rst = cur.fetchone()
if rst:
    pno = rst[0]

cur.execute('''
    SELECT SNO FROM SUPPLIER
    WHERE SNAME=?
''', [key2])

rst = cur.fetchone()
if rst:
    sno = rst[0]

pno, sno

(1, 1)

In [ ]:
data = ['Smith', 'Screw', 10]

cur.execute('''
    INSERT INTO SELLS
    VALUES(
        (SELECT SNO FROM SUPPLIER WHERE SNAME=? LIMIT 0, 1),
        (SELECT PNO FROM PART WHERE PNAME=? LIMIT 0, 1),
    ?
    )
''', data)

In [ ]:
cur.execute('SELECT * FROM SELLS')
cur.fetchall()

[(1, 1, 10)]

In [ ]:
CITY = dict()

cur.execute('SELECT * FROM CITY')
for row in cur.fetchall():
    CITY[row[1]] = row[0]

In [ ]:
CITY['London']

1

In [ ]:
data = [(1,2,8),
        (2,4,38),
        (3,1,11),
        (3,3,6),
        (4,2,7),
        (4,3,4),
        (4,4,45)]
cur.executemany('INSERT INTO SELLS VALUES(?,?,?)', data)

In [ ]:
# 73
# cur.execute('''
#     SELECT C.CNAME, COUNT(*)
#     FROM SUPPLIER AS S, CITY AS C
#     WHERE S.CNO = C.CNO
#     GROUP BY C.CNAME
#     ORDER BY C.CNAME, S.SNAME ASC
# ''')
# cur.execute('''
#     SELECT PNAME, COUNT(*), SUM(PRICE)
#     FROM SELLS, SUPPLIER, PART
#     WHERE SELLS.SNO = SUPPLIER.SNO AND SELLS.PNO = PART.PNO
#     GROUP BY PART.PNO
#     ORDER BY PRICE DESC
# ''')
cur.execute('''
    SELECT SNAME, COUNT(*), SUM(PRICE)
    FROM SELLS, SUPPLIER, PART
    WHERE SELLS.SNO = SUPPLIER.SNO AND SELLS.PNO = PART.PNO
    GROUP BY SUPPLIER.SNO
    ORDER BY PRICE DESC
''')
cur.fetchall()

[('Jones', 1, 38), ('Adams', 2, 17), ('Smith', 2, 18), ('Blake', 3, 56)]

In [ ]:
con.close()

In [ ]:
con = sqlite3.connect('0905.db')
cur = con.cursor()

In [ ]:
cur.execute('''
    CREATE TABLE PART(
        PNO INTEGER PRIMARY KEY,
        PNAME TEXT
    )
''')

In [ ]:
cur.executescript('''
    INSERT INTO PART VALUES(1,'Screw');
    INSERT INTO PART(PNAME) VALUES('Bolt');
    INSERT INTO PART VALUES(NULL, 'Nut');
    INSERT INTO PART VALUES(4, 'Cam');
''')

In [ ]:
cur.execute('INSERT INTO PART VALUES(NULL, "Part1")')

In [ ]:
cur.execute('SELECT * FROM PART')
cur.fetchall()

[(1, 'Screw'), (2, 'Bolt'), (3, 'Nut'), (4, 'Cam'), (5, 'Part1')]

In [ ]:
con.close()

In [ ]:
con = sqlite3.connect('0905.db')
cur = con.cursor()

In [ ]:
cur.execute('SELECT * FROM PART')
cur.fetchall()

In [ ]:
con.commit()

In [ ]:
cur.execute('''
    UPDATE PART
    SET PNAME='아무거나'
''')

In [ ]:
con.total_changes

10

In [ ]:
cur.execute('SELECT * FROM PART')
cur.fetchall()

[(1, '아무거나'), (2, '아무거나'), (3, '아무거나'), (4, '아무거나'), (5, '아무거나')]

In [ ]:
cur.execute('INSERT INTO PART VALUES(NULL, "ㅇㅇㅇㅇ")')

In [ ]:
cur.lastrowid # 맹신금지

6

In [ ]:
cur.execute('SELECT * FROM PART')
cur.fetchall()[-1]

(6, 'ㅇㅇㅇㅇ')

In [ ]:
con.close()

In [ ]:
con = sqlite3.connect('0905.db')

In [ ]:
cur = con.cursor()

In [ ]:
cur.executescript('''
    DROP TABLE IF EXISTS TEMP;
    CREATE TABLE TEMP(
        PK INTEGER NOT NULL UNIQUE,
        NAME TEXT NOT NULL
    );

    INSERT INTO TEMP VALUES(1,'테스트1');
    INSERT INTO TEMP VALUES(2,'테스트2');
    INSERT INTO TEMP VALUES(3,'테스트3');
''')

In [ ]:
for line in con.iterdump():
    print(line)

BEGIN TRANSACTION;
CREATE TABLE PART(
        PNO INTEGER PRIMARY KEY,
        PNAME TEXT
    );
INSERT INTO "PART" VALUES(1,'Screw');
INSERT INTO "PART" VALUES(2,'Bolt');
INSERT INTO "PART" VALUES(3,'Nut');
INSERT INTO "PART" VALUES(4,'Cam');
CREATE TABLE TEMP(
        PK INTEGER NOT NULL UNIQUE,
        NAME TEXT NOT NULL
    );
INSERT INTO "TEMP" VALUES(1,'테스트1');
INSERT INTO "TEMP" VALUES(2,'테스트2');
INSERT INTO "TEMP" VALUES(3,'테스트3');
COMMIT;

In [ ]:
con.close()

In [ ]:
con = sqlite3.connect('sns.db')
cur = con.cursor()

In [ ]:
cur.executescript('''
    CREATE TABLE POST(
        PK INTEGER PRIMARY KEY,
        CONTENT TEXT
    );
    CREATE TABLE HASHTAG(
        PK INTEGER PRIMARY KEY,
        COUNT INTEGER DEFAULT 0,
        NAME TEXT
    );
    CREATE TABLE POSTTAG(
        PPK INTEGER NOT NULL,
        HPK INTEGER NOT NULL
    );
''')

In [ ]:
# HASHTAG Pool <= TAG가 있는지 검사하는
# 있으면, PK, 없으면 새롭게 INSERT
data = {'tag':'ORM'}

cur.execute('''
    SELECT COUNT(*) FROM HASHTAG
    WHERE NAME=:tag
''', data)

if cur.fetchone()[0] == 0:
    cur.execute('''
        INSERT INTO HASHTAG(NAME) VALUES(:tag)
    ''', data)
    con.commit()

cur.execute('''
    SELECT PK
    FROM HASHTAG
    WHERE NAME=:tag
    LIMIT 0,1
''', data)

PK = cur.fetchone()[0]
PK

In [ ]:
# Posting 하는 부분
data1 = {'content':'본문1', 'tags':['Python']}

cur.execute('INSERT INTO POST(CONTENT) VALUES(:content)', data1)
con.commit()
PPK = cur.lastrowid

for tag in data1['tags']:
    data2 = {'tag':tag}

    cur.execute('''
        SELECT COUNT(*) FROM HASHTAG
        WHERE NAME=:tag
    ''', data2)

    if cur.fetchone()[0] == 0:
        cur.execute('''
            INSERT INTO HASHTAG(NAME) VALUES(:tag)
        ''', data2)
        con.commit()

    cur.execute('''
        SELECT PK
        FROM HASHTAG
        WHERE NAME=:tag
        LIMIT 0,1
    ''', data2)

    TPK = cur.fetchone()[0]

    cur.execute('INSERT INTO POSTTAG VALUES(?,?)', [PPK, TPK])
    cur.execute('''
        UPDATE HASHTAG SET COUNT = COUNT + 1
        WHERE PK=?
    ''', [TPK])
    con.commit()

In [ ]:
# 숙제: 수정 서비스 로직

In [ ]:
!pip install SQLAlchemy

In [ ]:
from sqlalchemy import create_engine, MetaData
from sqlalchemy.schema import Table, Column, ForeignKey
from sqlalchemy.types import Integer, Text

In [ ]:
engine = create_engine('sqlite:///:memory:', echo=True)

In [ ]:
meta = MetaData()

In [ ]:
user = Table('USER', meta,
             Column('PK', Integer, primary_key=True),
             Column('NAME', Text, nullable=True))

In [ ]:
meta.create_all(engine)

In [ ]:
meta.clear()

In [ ]:
meta.tables

In [ ]:
meta.create_all(engine)

In [ ]:
meta.reflect(engine)

In [ ]:
meta.tables

In [ ]:
user1 = user.insert().values(NAME='아무개')

In [ ]:
print(user1.compile(), user1.compile().params)

In [ ]:
import sqlite3
           Server
Python      DBMS - DB
Client ---> connection
cursor --->  작업공간
con - cur
               SQL
      execute
con = sqlite3.connect(':memory:')
cur = con.cursor()
con.close()
cur.execute('SQL문 1개')
cur.executemany('SQL문 1개가 반복실행')
cur.executescript('SQL문 여러개 한번에 실행')
cur.execute('''
    CREATE TABLE CITY (
        CNO INTEGER PRIMARY KEY,
        CNAME TEXT
    )
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('''
    INSERT INTO CITY (CNO, CNAME)
    VALUES(1, "London");
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('''
    INSERT INTO CITY
    VALUES(2, "Paris")
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('''
    INSERT INTO CITY (CNAME)
    VALUES("Rome")
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('''
    INSERT INTO CITY
    VALUES(NULL, "Vienna")
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.fetchone('Tuple/Record/Row 1개')
cur.fetchmany('N개')
cur.fetchall('All')
cur.execute('SELECT * FROM CITY')
<sqlite3.Cursor at 0x1101bfa40>
# cur.fetchone()
# cur.fetchmany(2)
cur.fetchall()
[(1, 'London'), (2, 'Paris'), (3, 'Rome'), (4, 'Vienna')]
cur.execute('''
    CREATE TABLE TEMP(
        PK INTEGER NOT NULL UNIQUE,
        NAME CHAR(5) NOT NULL
    )
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('INSERt INTO TEMP VALUES(1, "ABCDEFGGHH")')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('SELECT * FROM TEMP')
<sqlite3.Cursor at 0x1101bfa40>
cur.fetchall()
[]
cur.execute('''
    CREATE TABLE SUPPLIER(
        SNO INTEGER PRIMARY KEY,
        SNAME TEXT NOT NULL DEFAULT 'NONAME',
        CNO INTEGER NOT NULL
    )
''')
<sqlite3.Cursor at 0x1101bfa40>
# qmark = ?, named = k:v
sname = 'Smith'
cno = 1

cur.execute('''
    INSERT INTO SUPPLIER VALUES(NULL, ?, ?);
''', (sname, cno))
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('SELECT * FROM SUPPLIER')
cur.fetchall()
[(1, 'Smith', 1)]
data = (('Jones', 2), ('Adams', 1), ('Blake', 3))

cur.executemany('''
    INSERT INTO SUPPLIER VALUES(NULL, ?, ?);
''', data)
<sqlite3.Cursor at 0x1101bfa40>
len(data), len(data[0])
(3, 2)
cur.execute('SELECT * FROM SUPPLIER')
cur.fetchall()
[(1, 'Smith', 1), (2, 'Jones', 2), (3, 'Adams', 1), (4, 'Blake', 3)]
cur.execute('''
    CREATE TABLE PART(
        PNO INTEGER PRIMARY KEY AUTOINCREMENT,
        PNAME TEXT
    )
''')
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('''
    INSERT INTO PART
    VALUES(:pno, :pname)
''', {'pno':1, 'pname':'Screw', 'asdf':'asdf'})
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('SELECT * FROM PART')
cur.fetchall()
[(1, 'Screw')]
data = [{'pname':'Nut'},
        {'pname':'Bolt'},
        {'pname':'Cam'}]

cur.executemany('''
    INSERT INTO PART
    VALUES(NULL, :pname)
''', data)
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('''
    CREATE TABLE SELLS(
        SNO INTEGER NOT NULL,
        PNO INTEGER NOT NULL,
        PRICE INTEGER NOT NULL
    );
''')
<sqlite3.Cursor at 0x1101bfa40>
key1 = 'Screw'
key2 = 'Smith'
sno = 0
pno = 0

cur.execute('''
    SELECT PNO FROM PART
    WHERE PNAME=?
''', [key1])
rst = cur.fetchone()
if rst:
    pno = rst[0]

cur.execute('''
    SELECT SNO FROM SUPPLIER
    WHERE SNAME=?
''', [key2])

rst = cur.fetchone()
if rst:
    sno = rst[0]

pno, sno
(1, 1)
data = ['Smith', 'Screw', 10]

cur.execute('''
    INSERT INTO SELLS
    VALUES(
        (SELECT SNO FROM SUPPLIER WHERE SNAME=? LIMIT 0, 1),
        (SELECT PNO FROM PART WHERE PNAME=? LIMIT 0, 1),
    ?
    )
''', data)
<sqlite3.Cursor at 0x1101bfa40>
cur.execute('SELECT * FROM SELLS')
cur.fetchall()
[(1, 1, 10)]
CITY = dict()

cur.execute('SELECT * FROM CITY')
for row in cur.fetchall():
    CITY[row[1]] = row[0]
CITY['London']
1
data = [(1,2,8),
        (2,4,38),
        (3,1,11),
        (3,3,6),
        (4,2,7),
        (4,3,4),
        (4,4,45)]
cur.executemany('INSERT INTO SELLS VALUES(?,?,?)', data)
<sqlite3.Cursor at 0x1101bfa40>
# 73
# cur.execute('''
#     SELECT C.CNAME, COUNT(*)
#     FROM SUPPLIER AS S, CITY AS C
#     WHERE S.CNO = C.CNO
#     GROUP BY C.CNAME
#     ORDER BY C.CNAME, S.SNAME ASC
# ''')
# cur.execute('''
#     SELECT PNAME, COUNT(*), SUM(PRICE)
#     FROM SELLS, SUPPLIER, PART
#     WHERE SELLS.SNO = SUPPLIER.SNO AND SELLS.PNO = PART.PNO
#     GROUP BY PART.PNO
#     ORDER BY PRICE DESC
# ''')
cur.execute('''
    SELECT SNAME, COUNT(*), SUM(PRICE)
    FROM SELLS, SUPPLIER, PART
    WHERE SELLS.SNO = SUPPLIER.SNO AND SELLS.PNO = PART.PNO
    GROUP BY SUPPLIER.SNO
    ORDER BY PRICE DESC
''')
cur.fetchall()
[('Jones', 1, 38), ('Adams', 2, 17), ('Smith', 2, 18), ('Blake', 3, 56)]
con.close()
con = sqlite3.connect('0905.db')
cur = con.cursor()
cur.execute('''
    CREATE TABLE PART(
        PNO INTEGER PRIMARY KEY,
        PNAME TEXT
    )
''')
<sqlite3.Cursor at 0x1141bf9d0>
cur.executescript('''
    INSERT INTO PART VALUES(1,'Screw');
    INSERT INTO PART(PNAME) VALUES('Bolt');
    INSERT INTO PART VALUES(NULL, 'Nut');
    INSERT INTO PART VALUES(4, 'Cam');
''')
<sqlite3.Cursor at 0x1141bf9d0>
cur.execute('INSERT INTO PART VALUES(NULL, "Part1")')
<sqlite3.Cursor at 0x1141765e0>
cur.execute('SELECT * FROM PART')
cur.fetchall()
[(1, 'Screw'), (2, 'Bolt'), (3, 'Nut'), (4, 'Cam'), (5, 'Part1')]
con.close()
con = sqlite3.connect('0905.db')
cur = con.cursor()
cur.execute('SELECT * FROM PART')
cur.fetchall()
[(1, 'Screw'), (2, 'Bolt'), (3, 'Nut'), (4, 'Cam'), (5, 'Part1')]
con.commit()
cur.execute('''
    UPDATE PART
    SET PNAME='아무거나'
''')
<sqlite3.Cursor at 0x1141d4ab0>
con.total_changes
10
cur.execute('SELECT * FROM PART')
cur.fetchall()
[(1, '아무거나'), (2, '아무거나'), (3, '아무거나'), (4, '아무거나'), (5, '아무거나')]
cur.execute('INSERT INTO PART VALUES(NULL, "ㅇㅇㅇㅇ")')
<sqlite3.Cursor at 0x1141d4ab0>
cur.lastrowid # 맹신금지
6
cur.execute('SELECT * FROM PART')
cur.fetchall()[-1]
(6, 'ㅇㅇㅇㅇ')
con.close()
con = sqlite3.connect('0905.db')
cur = con.cursor()
cur.executescript('''
    DROP TABLE IF EXISTS TEMP;
    CREATE TABLE TEMP(
        PK INTEGER NOT NULL UNIQUE,
        NAME TEXT NOT NULL
    );

    INSERT INTO TEMP VALUES(1,'테스트1');
    INSERT INTO TEMP VALUES(2,'테스트2');
    INSERT INTO TEMP VALUES(3,'테스트3');
''')
<sqlite3.Cursor at 0x1141e9b20>
for line in con.iterdump():
    print(line)
BEGIN TRANSACTION;
CREATE TABLE PART(
        PNO INTEGER PRIMARY KEY,
        PNAME TEXT
    );
INSERT INTO "PART" VALUES(1,'Screw');
INSERT INTO "PART" VALUES(2,'Bolt');
INSERT INTO "PART" VALUES(3,'Nut');
INSERT INTO "PART" VALUES(4,'Cam');
INSERT INTO "PART" VALUES(5,'Part1');
CREATE TABLE TEMP(
        PK INTEGER NOT NULL UNIQUE,
        NAME TEXT NOT NULL
    );
INSERT INTO "TEMP" VALUES(1,'테스트1');
INSERT INTO "TEMP" VALUES(2,'테스트2');
INSERT INTO "TEMP" VALUES(3,'테스트3');
COMMIT;
con.close()
con = sqlite3.connect('sns.db')
cur = con.cursor()
cur.executescript('''
    CREATE TABLE POST(
        PK INTEGER PRIMARY KEY,
        CONTENT TEXT
    );
    CREATE TABLE HASHTAG(
        PK INTEGER PRIMARY KEY,
        COUNT INTEGER DEFAULT 0,
        NAME TEXT
    );
    CREATE TABLE POSTTAG(
        PPK INTEGER NOT NULL,
        HPK INTEGER NOT NULL
    );
''')
<sqlite3.Cursor at 0x1141fe420>
# HASHTAG Pool <= TAG가 있는지 검사하는
# 있으면, PK, 없으면 새롭게 INSERT
data = {'tag':'ORM'}

cur.execute('''
    SELECT COUNT(*) FROM HASHTAG
    WHERE NAME=:tag
''', data)

if cur.fetchone()[0] == 0:
    cur.execute('''
        INSERT INTO HASHTAG(NAME) VALUES(:tag)
    ''', data)
    con.commit()

cur.execute('''
    SELECT PK
    FROM HASHTAG
    WHERE NAME=:tag
    LIMIT 0,1
''', data)

PK = cur.fetchone()[0]
PK
2
# Posting 하는 부분
data1 = {'content':'본문1', 'tags':['Python']}

cur.execute('INSERT INTO POST(CONTENT) VALUES(:content)', data1)
con.commit()
PPK = cur.lastrowid

for tag in data1['tags']:
    data2 = {'tag':tag}

    cur.execute('''
        SELECT COUNT(*) FROM HASHTAG
        WHERE NAME=:tag
    ''', data2)

    if cur.fetchone()[0] == 0:
        cur.execute('''
            INSERT INTO HASHTAG(NAME) VALUES(:tag)
        ''', data2)
        con.commit()

    cur.execute('''
        SELECT PK
        FROM HASHTAG
        WHERE NAME=:tag
        LIMIT 0,1
    ''', data2)

    TPK = cur.fetchone()[0]

    cur.execute('INSERT INTO POSTTAG VALUES(?,?)', [PPK, TPK])
    cur.execute('''
        UPDATE HASHTAG SET COUNT = COUNT + 1
        WHERE PK=?
    ''', [TPK])
    con.commit()
# 숙제: 수정 서비스 로직
!pip install SQLAlchemy
from sqlalchemy import create_engine, MetaData
from sqlalchemy.schema import Table, Column, ForeignKey
from sqlalchemy.types import Integer, Text
engine = create_engine('sqlite:///:memory:', echo=True)
meta = MetaData()
user = Table('USER', meta,
             Column('PK', Integer, primary_key=True),
             Column('NAME', Text, nullable=True))
meta.create_all(engine)
2023-09-05 12:24:38,749 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-09-05 12:24:38,752 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("USER")
2023-09-05 12:24:38,754 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:24:38,755 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("USER")
2023-09-05 12:24:38,756 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:24:38,758 INFO sqlalchemy.engine.Engine
CREATE TABLE "USER" (
	"PK" INTEGER NOT NULL,
	"NAME" TEXT,
	PRIMARY KEY ("PK")
)


2023-09-05 12:24:38,760 INFO sqlalchemy.engine.Engine [no key 0.00154s] ()
2023-09-05 12:24:38,761 INFO sqlalchemy.engine.Engine COMMIT
meta.clear()
meta.tables
FacadeDict({})
meta.create_all(engine)
2023-09-05 12:25:58,313 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2023-09-05 12:25:58,319 INFO sqlalchemy.engine.Engine COMMIT
meta.reflect(engine)
2023-09-05 12:27:01,111 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-09-05 12:27:01,114 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,116 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("USER")
2023-09-05 12:27:01,116 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,118 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-09-05 12:27:01,119 INFO sqlalchemy.engine.Engine [raw sql] ('USER',)
2023-09-05 12:27:01,121 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("USER")
2023-09-05 12:27:01,121 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,123 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("USER")
2023-09-05 12:27:01,124 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,125 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-09-05 12:27:01,125 INFO sqlalchemy.engine.Engine [raw sql] ('USER',)
2023-09-05 12:27:01,127 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("USER")
2023-09-05 12:27:01,128 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,129 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("USER")
2023-09-05 12:27:01,130 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,131 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("USER")
2023-09-05 12:27:01,131 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,132 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("USER")
2023-09-05 12:27:01,133 INFO sqlalchemy.engine.Engine [raw sql] ()
2023-09-05 12:27:01,133 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2023-09-05 12:27:01,133 INFO sqlalchemy.engine.Engine [raw sql] ('USER',)
meta.tables
FacadeDict({'USER': Table('USER', MetaData(), Column('PK', INTEGER(), table=<USER>, primary_key=True, nullable=False), Column('NAME', TEXT(), table=<USER>), schema=None)})
user1 = user.insert().values(NAME='아무개')
print(user1.compile(), user1.compile().params)
INSERT INTO "USER" ("NAME") VALUES (:NAME) {'NAME': '아무개'}